#!/usr/bin/python
# -*- coding: UTF-8 -*-
global ءلحثصظياساهدلقزبكشالحسوءء;global جثثككمنثغزقرءشاضحثزضوطقذب;ءلحثصظياساهدلقزبكشالحسوءء = 2.718281828459045;جثثككمنثغزقرءشاضحثزضوطقذب = 0.017453292519943295;دحعثحتشثقظهرزثسانكعقععجشد = range;ضسمسمعققيشبلدفلحغتءكحذغخو = دحعثحتشثقظهرزثسانكعقععجشد;بضكثزشصوعقذترلتاصسعطوظصين = ضسمسمعققيشبلدفلحغتءكحذغخو

def طودحطريسييضفلشثثعلتازطسغض(يقهدذظيججثشكلعتطللهاصذخقط):
    يتثفتخشجييششاتصسدنضزقراذظ = يقهدذظيججثشكلعتطللهاصذخقط - 1
    while يتثفتخشجييششاتصسدنضزقراذظ != 0:
        يقهدذظيججثشكلعتطللهاصذخقط = يقهدذظيججثشكلعتطللهاصذخقط * يتثفتخشجييششاتصسدنضزقراذظ
        يتثفتخشجييششاتصسدنضزقراذظ = يتثفتخشجييششاتصسدنضزقراذظ - 1
    return(يقهدذظيججثشكلعتطللهاصذخقط)

def sin(ضظذاوفيظبزليوهحابشقثجاذدش):
    وتغتضبشرخسثكعخفتذقضزظيهزح = ضظذاوفيظبزليوهحابشقثجاذدش * جثثككمنثغزقرءشاضحثزضوطقذب
    غيوءمسطمبزهتاطجزقيشثطقكود = 3
    حضكفحوشجخضتدزقفلصءصرقءطبا = 0
    رششطكمخبسسغزيذلءكظعزتعجخز = 3
    for نيحقهحعيرظددشجزظسءسكسصظجب in دحعثحتشثقظهرزثسانكعقععجشد(20):
        if غيوءمسطمبزهتاطجزقيشثطقكود == 1:
            حضكفحوشجخضتدزقفلصءصرقءطبا = حضكفحوشجخضتدزقفلصءصرقءطبا + وتغتضبشرخسثكعخفتذقضزظيهزح**رششطكمخبسسغزيذلءكظعزتعجخز/طودحطريسييضفلشثثعلتازطسغض(رششطكمخبسسغزيذلءكظعزتعجخز)
            رششطكمخبسسغزيذلءكظعزتعجخز = رششطكمخبسسغزيذلءكظعزتعجخز + 2
            غيوءمسطمبزهتاطجزقيشثطقكود = 0
        elif غيوءمسطمبزهتاطجزقيشثطقكود == 0:
            حضكفحوشجخضتدزقفلصءصرقءطبا = حضكفحوشجخضتدزقفلصءصرقءطبا - وتغتضبشرخسثكعخفتذقضزظيهزح**رششطكمخبسسغزيذلءكظعزتعجخز/طودحطريسييضفلشثثعلتازطسغض(رششطكمخبسسغزيذلءكظعزتعجخز)
            رششطكمخبسسغزيذلءكظعزتعجخز = رششطكمخبسسغزيذلءكظعزتعجخز + 2
            غيوءمسطمبزهتاطجزقيشثطقكود = 1
        else:
            حضكفحوشجخضتدزقفلصءصرقءطبا = وتغتضبشرخسثكعخفتذقضزظيهزح
            غيوءمسطمبزهتاطجزقيشثطقكود = 0
    return(حضكفحوشجخضتدزقفلصءصرقءطبا)

def cos(ضظذاوفيظبزليوهحابشقثجاذدش):
    وتغتضبشرخسثكعخفتذقضزظيهزح = ضظذاوفيظبزليوهحابشقثجاذدش * جثثككمنثغزقرءشاضحثزضوطقذب
    غيوءمسطمبزهتاطجزقيشثطقكود = 3
    حضكفحوشجخضتدزقفلصءصرقءطبا = 0
    رششطكمخبسسغزيذلءكظعزتعجخز = 2
    for نيحقهحعيرظددشجزظسءسكسصظجب in بضكثزشصوعقذترلتاصسعطوظصين(20):
        if غيوءمسطمبزهتاطجزقيشثطقكود == 1:
            حضكفحوشجخضتدزقفلصءصرقءطبا = حضكفحوشجخضتدزقفلصءصرقءطبا + وتغتضبشرخسثكعخفتذقضزظيهزح**رششطكمخبسسغزيذلءكظعزتعجخز/طودحطريسييضفلشثثعلتازطسغض(رششطكمخبسسغزيذلءكظعزتعجخز)
            رششطكمخبسسغزيذلءكظعزتعجخز = رششطكمخبسسغزيذلءكظعزتعجخز + 2
            غيوءمسطمبزهتاطجزقيشثطقكود = 0
        elif غيوءمسطمبزهتاطجزقيشثطقكود == 0:
            حضكفحوشجخضتدزقفلصءصرقءطبا = حضكفحوشجخضتدزقفلصءصرقءطبا - وتغتضبشرخسثكعخفتذقضزظيهزح**رششطكمخبسسغزيذلءكظعزتعجخز/طودحطريسييضفلشثثعلتازطسغض(رششطكمخبسسغزيذلءكظعزتعجخز)
            رششطكمخبسسغزيذلءكظعزتعجخز = رششطكمخبسسغزيذلءكظعزتعجخز + 2
            غيوءمسطمبزهتاطجزقيشثطقكود = 1
        else:
            حضكفحوشجخضتدزقفلصءصرقءطبا = 1
            غيوءمسطمبزهتاطجزقيشثطقكود = 0
    return(حضكفحوشجخضتدزقفلصءصرقءطبا)

def tan(ضظذاوفيظبزليوهحابشقثجاذدش):
    return(sin(ضظذاوفيظبزليوهحابشقثجاذدش)/cos(ضظذاوفيظبزليوهحابشقثجاذدش))

def cosh(ضظذاوفيظبزليوهحابشقثجاذدش):
    return((ءلحثصظياساهدلقزبكشالحسوءء**ضظذاوفيظبزليوهحابشقثجاذدش + ءلحثصظياساهدلقزبكشالحسوءء**(-1*ضظذاوفيظبزليوهحابشقثجاذدش))/2)

def sinh(ضظذاوفيظبزليوهحابشقثجاذدش):
    return((ءلحثصظياساهدلقزبكشالحسوءء**ضظذاوفيظبزليوهحابشقثجاذدش - ءلحثصظياساهدلقزبكشالحسوءء**(-1*ضظذاوفيظبزليوهحابشقثجاذدش))/2)

def tanh(ضظذاوفيظبزليوهحابشقثجاذدش):
    return(sinh(ضظذاوفيظبزليوهحابشقثجاذدش)/cosh(ضظذاوفيظبزليوهحابشقثجاذدش))
